{"date":1632573361,"cats":[0,13,14,48],"content":"<h2><strong>What is ArrayPool? Why is it needed?</strong></h2><p>The ArrayPool&lt;T&gt; class in the System.Buffers namespace is a high-performance pool of reusable managed arrays. It can be used to minimize allocations and improve performance in cases where arrays are often reused.</p><p></p><h2><strong>Use the ArrayPool&lt;T&gt; class in C#</strong></h2><p>You can use the ArrayPool&lt;T&gt; class in the following three ways:</p><aside></aside><ul><li>Using the ArrayPool&lt;T&gt;.Shared property to get a shared ArrayPool&lt;T&gt; instance</li><li>Using the static ArrayPool&lt;T&gt;.Create method to create a new instance of ArrayPool&lt;T&gt;</li><li>Creating a custom ArrayPool class by extending ArrayPool&lt;T&gt;</li></ul><p></p><p><br></p><p></p><h2><strong>Use the MemoryPool&lt;T&gt; class in C#</strong></h2><p>The System.Buffers.MemoryPool&lt;T&gt; class pertaining to the System.Memory namespace represents a memory pool. MemoryPool&lt;T&gt; is a good choice when your code needs to allocate blocks of memory and you would like to reduce the pressure on the GC by reusing the allocated memory rather than creating new memory blocks each time.</p><p></p><p></p><h2>ArrayPool&lt;T&gt; vs. MemoryPool&lt;T&gt;</h2><p>The ArrayPool&lt;T&gt; class rents out arrays using the Shared property, while the MemoryPool&lt;T&gt; class rents out IMemoryOwner&lt;T&gt; implementations. You should use ArrayPool&lt;T&gt; if you need to create array instances repeatedly. And you should use MemoryPool&lt;T&gt; if you’re working with Memory&lt;T&gt; instances.&nbsp;Memory pools are used to reuse existing memory blocks; you can use them to allocate memory blocks dynamically. Array pools manage a pool of arrays and rent them when asked for.</p><p><a href=\"https://www.infoworld.com/article/3596289/how-to-use-arraypool-and-memorypool-in-c.html\">https://www.infoworld.com/article/3596289/how-to-use-arraypool-and-memorypool-in-c.html</a><br></p><p></p>","title":"How to use ArrayPool and MemoryPool in C#","slug":"how-to-use-arraypool-and-memorypool-in-c-nt4r"}