{"date":1598021082,"cats":[0,4,7],"content":"<p>Ksnip is a Qt based cross-platform screenshot tool that provides many annotation features for your screenshots.</p><p><img src=\"https://raw.githubusercontent.com/eramax/myBlogStorage/master/public/uploads/2020/7/1598021082s6ims.png\" style=\"width: 912px; height: 617px;\"></p><h1>Features</h1><p>Latest ksnip version contains following features:</p><ul><li>Supports Linux (X11, Plasma Wayland and Gnome Wayland), Windows and macOS.</li><li>Taking screenshot of a custom rectangular area that can be drawn with mouse cursor.</li><li>Taking screenshot of last selected rectangular area without selecting again.</li><li>Taking screenshot of the screen/monitor where the mouse cursor is currently located.</li><li>Taking screenshot of full screen, including all screens/monitors.</li><li>Taking screenshot of window that currently has focus.</li><li>Taking screenshot of window under mouse cursor.</li><li>Take screenshot with or without mouse cursor.</li><li>Capture mouse cursor as annotation item that can be moved and deleted.</li><li>Customizable capture delay for all capture options.</li><li>Upload screenshots directly to imgur.com in anonymous or user mode.</li><li>Upload screenshots via custom user defined scripts.</li><li>Command line support, for taking screenshot and saving it to default location, filename and format.</li><li>Filename wildcards for Year ($Y), Month ($M), Day ($D), Time ($T) and Counter (multiple # characters for number with zero leading padding).</li><li>Print screenshot or save is to pdf/ps.</li><li>Annotate screenshots with pen, marker, rectangles, ellipses, texts and other tools.</li><li>Annotate screenshots with stickers and add custom stickers.</li><li>Add watermarks to captured images.</li><li>Global HotKeys for taking Screenshots (Currently only for Windows and X11).</li><li>Tabs for Screenshots and images.</li><li>Open existing images via dialog, drag-and-drop or paste from clipboard.</li><li>Run as single instance application (secondary instances send cli parameter to primary instance).</li><li>Pin Screenshots in Frameless windows that stay on top of other windows.</li><li>Many configuration options.</li></ul><a href=\"https://github.com/ksnip/ksnip\">https://github.com/ksnip/ksnip</a><p><br></p>","title":"ksnip screenshot","slug":"ksnip-screenshotbbmk"}